src/Documents/ПродажаТоваров/ПродажаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаТоваров</name>
  <registerRecords>AccountingRegister.РегистрБухУчет</registerRecords>
  <registerRecords>AccumulationRegister.БронированиеТоваров</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.Задолженности</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ПартииТоваровНаСкладах/ПартииТоваровНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПартииТоваровНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.СменаМетодаРасчетаСебестоимости</types>
      <types>DocumentRef.ЗакупкаТоваров</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccountingRegisters/РегистрБухУчет/РегистрБухУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>РегистрБухУчет</name>
  <chartOfAccounts>ChartOfAccounts.БухгалтерскийУчет</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <accountingFlag>ChartOfAccounts.БухгалтерскийУчет.AccountingFlag.Суммовой</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.БухгалтерскийУчет.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.БухгалтерскийУчет.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.БухгалтерскийУчет.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
</mdclass:AccountingRegister>

src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПродажаТоваров</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Задолженности/Задолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Задолженности</name>
  <resources>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/СвободныеОстатки/СвободныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СвободныеОстатки</name>
  <resources>
    <name>КоличествоВСвободномОстатке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/БронированиеТоваров/БронированиеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БронированиеТоваров</name>
  <resources>
    <name>КоличествоЗабронированного</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/СпособРасчетаСебестоимости/СпособРасчетаСебестоимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпособРасчетаСебестоимости</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>МетодРасчета</name>
    <type>
      <types>EnumRef.СпособыРасчетаСебестоимости</types>
    </type>
  </resources>
</mdclass:InformationRegister>

src/Enums/СпособыРасчетаСебестоимости/СпособыРасчетаСебестоимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРасчетаСебестоимости</name>
  <enumValues>
    <name>FIFO</name>
  </enumValues>
  <enumValues>
    <name>LIFO</name>
  </enumValues>
  <enumValues>
    <name>ПоСреднему</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ЗакупкаТоваров/ЗакупкаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакупкаТоваров</name>
  <registerRecords>AccountingRegister.РегистрБухУчет</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.Задолженности</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПродажаТоваров/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Блокируем в регистре остатков товары из документа
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ПартииТоваровНаСкладах");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный; //даже на чтение, чтобы никому не испортить расчет себестоимости
	ЭлементБлокировки.ИсточникДанных = Товары.Выгрузить(,"Товар");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Товар");
	Блокировка.Заблокировать();
	
	//Включаем запись движений для всех нужных регистров
	
	Движения.РегистрБухУчет.Записывать   = Истина;
	Движения.Продажи.Записывать          = Истина;
	Движения.Задолженности.Записывать    = Истина;
	Движения.СвободныеОстатки.Записывать = Истина;
	//Очищаем бронирование по этому документу
	Движения.БронированиеТоваров.Записывать = Истина;
	Движения.БронированиеТоваров.Записать();
	Движения.СвободныеОстатки.Записать();
	
	
	
	
	
	//Берем из регистра сведений последний установленный метод расчета себестоимости
	МетодРасчетаСебестоимости = РегистрыСведений.СпособРасчетаСебестоимости.ПолучитьПоследнее(Дата);
	
	Если МетодРасчетаСебестоимости = Неопределено Тогда
		Сообщить("Не задан способ расчёта себестоимости!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущийМетод = МетодРасчетаСебестоимости.МетодРасчета;
	
	
	
	//Применяем метод расчета себестоимости. В аргументы передаем информацию из документа и из регистров остатков
	Если ТекущийМетод = Перечисления.СпособыРасчетаСебестоимости.FIFO Тогда 		
		Отказ = СписатьПоФИФО();
	ИначеЕсли ТекущийМетод = Перечисления.СпособыРасчетаСебестоимости.ПоСреднему Тогда
		Отказ = СписатьПоСреднему();
	ИначеЕсли ТекущийМетод = Перечисления.СпособыРасчетаСебестоимости.LIFO Тогда
        Отказ = СписатьПоЛИФО();
	КонецЕсли;
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	
	
	
	//Движения бухучета по покупателям и выручке
	Движение = Движения.РегистрБухУчет.Добавить();
	Движение.Период = Дата;
	Движение.СчетДт = ПланыСчетов.БухгалтерскийУчет.Покупатели; //62
	Движение.СчетКт = ПланыСчетов.БухгалтерскийУчет.Выручка;    //90
	Движение.Сумма  = СуммаДокумента;
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Покупатель;
	
	//Движения по регистру Задолженности
	Движение = Движения.Задолженности.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Контрагент  = Покупатель;
	Движение.СуммаДолга  = СуммаДокумента;
	Движение.Период      = Дата;
	
	
	
	
	
КонецПроцедуры
	
	





//Перед записью автоматически вычисляем сумму всего документа
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры



Функция СписатьПоФИФО() 
	
	//В запросе узнаем из документа: сколько товара нужно и сколько осталось на остатках
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПродажаТоваровТовары.Товар КАК Товар,
	               |	СУММА(ПродажаТоваровТовары.Количество) КАК Требуется,
	               |	СУММА(ПродажаТоваровТовары.Сумма) КАК СуммаПродажи
	               |ПОМЕСТИТЬ втДокумент
	               |ИЗ
	               |	Документ.ПродажаТоваров.Товары КАК ПродажаТоваровТовары
	               |ГДЕ
	               |	ПродажаТоваровТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажаТоваровТовары.Товар
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДокумент.Товар КАК Товар,
	               |	втДокумент.Требуется КАК Требуется,
	               |	ПартииТоваровНаСкладахОстатки.Партия КАК Партия,
	               |	ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	               |	ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	               |	ПартииТоваровНаСкладахОстатки.Партия.Дата КАК ПартияДата,
	               |	втДокумент.СуммаПродажи КАК СуммаПродажи,
	               |	БронированиеТоваровОстатки.КоличествоЗабронированногоОстаток КАК ОстатокМинусБронь
	               |ИЗ
	               |	втДокумент КАК втДокумент
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	               |				&МоментВремени,
	               |				Склад = &Склад
	               |					И Номенклатура В
	               |						(ВЫБРАТЬ
	               |							втДокумент.Товар КАК Товар
	               |						ИЗ
	               |							втДокумент КАК втДокумент)) КАК ПартииТоваровНаСкладахОстатки
	               |		ПО втДокумент.Товар = ПартииТоваровНаСкладахОстатки.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БронированиеТоваров.Остатки КАК БронированиеТоваровОстатки
	               |		ПО втДокумент.Товар = БронированиеТоваровОстатки.Номенклатура
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПартияДата
	               |ИТОГИ
	               |	МАКСИМУМ(Требуется),
	               |	СУММА(КоличествоОстаток),
	               |	СУММА(СуммаОстаток),
	               |	МАКСИМУМ(СуммаПродажи),
	               |	СУММА(КоличествоОстаток) - МАКСИМУМ(ЕСТЬNULL(БронированиеТоваровОстатки.КоличествоЗабронированногоОстаток, 0)) КАК ОстатокМинусБронь
	               |ПО
	               |	Товар";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Склад", ЭтотОбъект.Склад);
	
	//Полагаем, что списание окажется успешным
	Отказ = Ложь;
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТоваров = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Движения.ПартииТоваровНаСкладах.Записывать = Истина;
	
	
	
	
	//Накапливаем себестоимость для регистра продаж
	ОбщаяСебестоимостьСписания = 0;
	
	Пока ВыборкаТоваров.Следующий() Цикл
		
		ТребуетсяСписать = ВыборкаТоваров.Требуется;
		
		ВыборкаПартий = ВыборкаТоваров.Выбрать();
		Пока ВыборкаПартий.Следующий() Цикл
			
			Требуется = ВыборкаТоваров.Требуется;
			Доступно = ВыборкаТоваров.ОстатокМинусБронь;
			
			//Проверяем, достаточно ли товара на остатках
			Если Требуется > Доступно Тогда
				Сообщить("Недостаточно товара " + ВыборкаТоваров.Товар + " на складе");
				Отказ = Истина;
				Возврат Отказ;
			КонецЕсли;
			
			//Если все списали, переходим к след. товару
			Если ТребуетсяСписать = 0 Тогда
				Прервать;
			КонецЕсли;
			
			//Узнаем, сколько есть в партии и сколько из нее списать
			ДоступноПартия = ВыборкаПартий.КоличествоОстаток;
			КоличествоСписать = Мин(ТребуетсяСписать, ДоступноПартия);
			
			СебестоимостьЕдиницы = 0;
			Если ВыборкаПартий.КоличествоОстаток <> 0 Тогда
				СебестоимостьЕдиницы = ВыборкаПартий.СуммаОстаток / ВыборкаПартий.КоличествоОстаток;
			КонецЕсли;
			
			СуммаСписания = СебестоимостьЕдиницы * КоличествоСписать;
			ОбщаяСебестоимостьСписания = ОбщаяСебестоимостьСписания + СуммаСписания;
			
			//Регистр ПартииТоваровНаСкладах расход
			Движение = Движения.ПартииТоваровНаСкладах.Добавить();
            Движение.ВидДвижения  = ВидДвиженияНакопления.Расход;
            Движение.Период       = Дата;
            Движение.Номенклатура = ВыборкаТоваров.Товар;
            Движение.Склад        = Склад;
            Движение.Партия       = ВыборкаПартий.Партия;
            Движение.Количество   = КоличествоСписать;
            Движение.Сумма        = СуммаСписания;			
			
			
            //Обновляем количество к списанию
            ТребуетсяСписать = ТребуетсяСписать - КоличествоСписать;

		КонецЦикла;
		
		//регистр СвободныеОСтатки
		Движение = Движения.СвободныеОстатки.Добавить();
		Движение.ВидДвижения  = ВидДвиженияНакопления.Расход;
		Движение.Период       = Дата;
		Движение.Номенклатура = ВыборкаТоваров.Товар;
		Движение.Склад        = Склад;
		Движение.КоличествоВСвободномОстатке = ТребуетсяСписать;
		
		//регистр Продажи обороты
		Движение = Движения.Продажи.Добавить();
		Движение.Период        = Дата;
		Движение.Номенклатура  = ВыборкаТоваров.Товар;
		Движение.Покупатель    = Покупатель;
		Движение.Количество    = КоличествоСписать;
		Движение.Сумма         = ВыборкаТоваров.СуммаПродажи;
		Движение.Документ      = Ссылка;
		Движение.Себестоимость = СуммаСписания;
			
		//Регистр БухУчет
		ДвижениеБух = Движения.РегистрБухУчет.Добавить();
        ДвижениеБух.Период = Дата;
        ДвижениеБух.СчетДт = ПланыСчетов.БухгалтерскийУчет.Себестоимость; //90.02
        ДвижениеБух.СчетКт = ПланыСчетов.БухгалтерскийУчет.Товары; //41.01
        ДвижениеБух.Сумма  = СуммаСписания;
        ДвижениеБух.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ВыборкаТоваров.Товар;
		
				
	КонецЦикла;
	
	Возврат Отказ;
				
				
				
		
		
КонецФункции





Функция СписатьПоСреднему() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПродажаТоваровТовары.Товар КАК Товар,
	               |	СУММА(ПродажаТоваровТовары.Количество) КАК Требуется,
	               |	СУММА(ПродажаТоваровТовары.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ втДокумент
	               |ИЗ
	               |	Документ.ПродажаТоваров.Товары КАК ПродажаТоваровТовары
	               |ГДЕ
	               |	ПродажаТоваровТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажаТоваровТовары.Товар
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДокумент.Товар КАК Товар,
	               |	втДокумент.Требуется КАК Требуется,
	               |	ПартииТоваровНаСкладахОстатки.Партия КАК Партия,
	               |	ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	               |	ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	               |	ПартииТоваровНаСкладахОстатки.Партия.Дата КАК ПартияДата,
	               |	втДокумент.Сумма КАК СуммаПродажи,
	               |	БронированиеТоваровОстатки.КоличествоЗабронированногоОстаток КАК Бронь
	               |ИЗ
	               |	втДокумент КАК втДокумент
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	               |				&МоментВремени,
	               |				Склад = &Склад
	               |					И Номенклатура В
	               |						(ВЫБРАТЬ
	               |							втДокумент.Товар КАК Товар
	               |						ИЗ
	               |							втДокумент КАК втДокумент)) КАК ПартииТоваровНаСкладахОстатки
	               |		ПО втДокумент.Товар = ПартииТоваровНаСкладахОстатки.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БронированиеТоваров.Остатки КАК БронированиеТоваровОстатки
	               |		ПО втДокумент.Товар = БронированиеТоваровОстатки.Номенклатура
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПартияДата
	               |ИТОГИ
	               |	МАКСИМУМ(Требуется),
	               |	СУММА(КоличествоОстаток),
	               |	СУММА(СуммаОстаток),
	               |	МАКСИМУМ(СуммаПродажи),
	               |	СУММА(КоличествоОстаток) - МАКСИМУМ(ЕСТЬNULL(Бронь, 0)) КАК Бронь
	               |ПО
	               |	Товар";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Склад", ЭтотОбъект.Склад);
	
	//Полагаем, что списание окажется успешным
	Отказ = Ложь;
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТоваров = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	
	Движения.ПартииТоваровНаСкладах.Записывать = Истина;	

	
	//Перебираем товары в документе
	Пока ВыборкаТоваров.Следующий() Цикл
		
		Требуется = ВыборкаТоваров.Требуется;
		Доступно = ВыборкаТоваров.Бронь;
		
		//Проверяем, достаточно ли товара на остатке
		Если Требуется > Доступно Тогда
			Сообщить("Недостаточно товара " + ВыборкаТоваров.Товар + " на складе");
			Отказ = Истина;
			Возврат Отказ;
		КонецЕсли;
		
		Требуется = ВыборкаТоваров.Требуется;
		ОбщийОстатокКоличество = ВыборкаТоваров.КоличествоОстаток;
		ОбщийОстатокСумма = ВыборкаТоваров.СуммаОстаток;
		
		СебестоимостьЕдиницы = 0;
		
		Если ОбщийОстатокКоличество > 0 Тогда
			СебестоимостьЕдиницы = ОбщийОстатокСумма / ОбщийОстатокКоличество;
		КонецЕсли;
		
		СуммаСписания = СебестоимостьЕдиницы * Требуется;
		
		//Регистр ПартииТоваровНаСкладах расход
		Движение = Движения.ПартииТоваровНаСкладах.Добавить();
		Движение.ВидДвижения  = ВидДвиженияНакопления.Расход;
		Движение.Период       = Дата;
		Движение.Номенклатура = ВыборкаТоваров.Товар;
		Движение.Склад        = Склад;
		Движение.Партия       = Документы.ЗакупкаТоваров.ПустаяСсылка(); 
		Движение.Количество   = Требуется;
		Движение.Сумма        = СуммаСписания;
		
		//регистр Продажи обороты
		Движение = Движения.Продажи.Добавить();
		Движение.Период        = Дата;
		Движение.Номенклатура  = ВыборкаТоваров.Товар;
		Движение.Покупатель    = Покупатель;
		Движение.Количество    = Требуется;
		Движение.Сумма         = ВыборкаТоваров.СуммаПродажи;
		Движение.Документ      = Ссылка;
		Движение.Себестоимость = СуммаСписания;
		
		//Регистр БухУчет
		ДвижениеБух = Движения.РегистрБухУчет.Добавить();
        ДвижениеБух.Период = Дата;
        ДвижениеБух.СчетДт = ПланыСчетов.БухгалтерскийУчет.Себестоимость; //90.02
        ДвижениеБух.СчетКт = ПланыСчетов.БухгалтерскийУчет.Товары; //41.01
        ДвижениеБух.Сумма  = СуммаСписания;
        ДвижениеБух.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ВыборкаТоваров.Товар;
		
		//регистр СвободныеОСтатки
		Движение = Движения.СвободныеОстатки.Добавить();
		Движение.ВидДвижения  = ВидДвиженияНакопления.Расход;
		Движение.Период       = Дата;
		Движение.Номенклатура = ВыборкаТоваров.Товар;
		Движение.Склад        = Склад;
		Движение.КоличествоВСвободномОстатке = Требуется;
		
	КонецЦикла;
		
		
				
				
	Возврат Отказ;			
					
	
	
	
КонецФункции


Функция СписатьПоЛИФО()

	//В запросе узнаем из документа: сколько товара нужно и сколько осталось на остатках
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПродажаТоваровТовары.Товар КАК Товар,
	               |	СУММА(ПродажаТоваровТовары.Количество) КАК Требуется,
	               |	СУММА(ПродажаТоваровТовары.Сумма) КАК СуммаПродажи
	               |ПОМЕСТИТЬ втДокумент
	               |ИЗ
	               |	Документ.ПродажаТоваров.Товары КАК ПродажаТоваровТовары
	               |ГДЕ
	               |	ПродажаТоваровТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажаТоваровТовары.Товар
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДокумент.Товар КАК Товар,
	               |	втДокумент.Требуется КАК Требуется,
	               |	ПартииТоваровНаСкладахОстатки.Партия КАК Партия,
	               |	ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	               |	ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	               |	ПартииТоваровНаСкладахОстатки.Партия.Дата КАК ПартияДата,
	               |	втДокумент.СуммаПродажи КАК СуммаПродажи,
	               |	БронированиеТоваровОстатки.КоличествоЗабронированногоОстаток КАК ОстатокМинусБронь
	               |ИЗ
	               |	втДокумент КАК втДокумент
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	               |				&МоментВремени,
	               |				Склад = &Склад
	               |					И Номенклатура В
	               |						(ВЫБРАТЬ
	               |							втДокумент.Товар КАК Товар
	               |						ИЗ
	               |							втДокумент КАК втДокумент)) КАК ПартииТоваровНаСкладахОстатки
	               |		ПО втДокумент.Товар = ПартииТоваровНаСкладахОстатки.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БронированиеТоваров.Остатки КАК БронированиеТоваровОстатки
	               |		ПО втДокумент.Товар = БронированиеТоваровОстатки.Номенклатура
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПартияДата УБЫВ
	               |ИТОГИ
	               |	МАКСИМУМ(Требуется),
	               |	СУММА(КоличествоОстаток),
	               |	СУММА(СуммаОстаток),
	               |	МАКСИМУМ(СуммаПродажи),
	               |	СУММА(КоличествоОстаток) - МАКСИМУМ(ЕСТЬNULL(БронированиеТоваровОстатки.КоличествоЗабронированногоОстаток, 0)) КАК ОстатокМинусБронь
	               |ПО
	               |	Товар";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Склад", ЭтотОбъект.Склад);
	
	//Полагаем, что списание окажется успешным
	Отказ = Ложь;
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТоваров = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Движения.ПартииТоваровНаСкладах.Записывать = Истина;
	
	
	
	//Накапливаем себестоимость для регистра продаж
	ОбщаяСебестоимостьСписания = 0;
	
	Пока ВыборкаТоваров.Следующий() Цикл
		
		Требуется = ВыборкаТоваров.Требуется;
		Доступно = ВыборкаТоваров.ОстатокМинусБронь;
		
		//Проверяем, достаточно ли товара на остатке
		Если Требуется > Доступно Тогда
			Сообщить("Недостаточно товара " + ВыборкаТоваров.Товар + " на складе");
			Отказ = Истина;
			Возврат Отказ;
		КонецЕсли;
		
		ТребуетсяСписать = ВыборкаТоваров.Требуется;
		
		ВыборкаПартий = ВыборкаТоваров.Выбрать();
		Пока ВыборкаПартий.Следующий() Цикл
			
			//Если все списали, переходим к след. товару
			Если ТребуетсяСписать = 0 Тогда
				Прервать;
			КонецЕсли;
			
			//Узнаем, сколько есть в партии и сколько из нее списать
			ДоступноПартия = ВыборкаПартий.КоличествоОстаток;
			КоличествоСписать = Мин(ТребуетсяСписать, ДоступноПартия);
			
			СебестоимостьЕдиницы = 0;
			Если ВыборкаПартий.КоличествоОстаток <> 0 Тогда
				СебестоимостьЕдиницы = ВыборкаПартий.СуммаОстаток / ВыборкаПартий.КоличествоОстаток;
			КонецЕсли;
			
			СуммаСписания = СебестоимостьЕдиницы * КоличествоСписать;
			ОбщаяСебестоимостьСписания = ОбщаяСебестоимостьСписания + СуммаСписания;
			
			//Регистр ПартииТоваровНаСкладах расход
			Движение = Движения.ПартииТоваровНаСкладах.Добавить();
            Движение.ВидДвижения  = ВидДвиженияНакопления.Расход;
            Движение.Период       = Дата;
            Движение.Номенклатура = ВыборкаТоваров.Товар;
            Движение.Склад        = Склад;
            Движение.Партия       = ВыборкаПартий.Партия;
            Движение.Количество   = КоличествоСписать;
            Движение.Сумма        = СуммаСписания;
			
			
			
            //Обновляем количество к списанию
            ТребуетсяСписать = ТребуетсяСписать - КоличествоСписать;

		КонецЦикла;
		
		//регистр СвободныеОСтатки
		Движение = Движения.СвободныеОстатки.Добавить();
		Движение.ВидДвижения  = ВидДвиженияНакопления.Расход;
		Движение.Период       = Дата;
		Движение.Номенклатура = ВыборкаТоваров.Товар;
		Движение.Склад        = Склад;
		Движение.КоличествоВСвободномОстатке = ТребуетсяСписать;
		
		//регистр Продажи обороты
		Движение = Движения.Продажи.Добавить();
		Движение.Период        = Дата;
		Движение.Номенклатура  = ВыборкаТоваров.Товар;
		Движение.Покупатель    = Покупатель;
		Движение.Количество    = КоличествоСписать;
		Движение.Сумма         = ВыборкаТоваров.СуммаПродажи;
		Движение.Документ      = Ссылка;
		Движение.Себестоимость = СуммаСписания;
			
		//Регистр БухУчет
		ДвижениеБух = Движения.РегистрБухУчет.Добавить();
        ДвижениеБух.Период = Дата;
        ДвижениеБух.СчетДт = ПланыСчетов.БухгалтерскийУчет.Себестоимость; //90.02
        ДвижениеБух.СчетКт = ПланыСчетов.БухгалтерскийУчет.Товары; //41.01
        ДвижениеБух.Сумма  = СуммаСписания;
        ДвижениеБух.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ВыборкаТоваров.Товар;
		
		
				
	КонецЦикла;
	
	Возврат Отказ;
	
КонецФункции




Процедура БронированиеТоваров() Экспорт

	//Записать();
	Движения.БронированиеТоваров.Записать();
	Движения.СвободныеОстатки.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПродажаТоваровТовары.Товар КАК Товар,
	               |	СУММА(ПродажаТоваровТовары.Количество) КАК Требуется
	               |ПОМЕСТИТЬ втДанныеДокумента
	               |ИЗ
	               |	Документ.ПродажаТоваров.Товары КАК ПродажаТоваровТовары
	               |ГДЕ
	               |	ПродажаТоваровТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажаТоваровТовары.Товар
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДанныеДокумента.Товар КАК Товар,
	               |	СвободныеОстаткиОстатки.КоличествоВСвободномОстаткеОстаток - втДанныеДокумента.Требуется КАК ПроверкаОстатков,
	               |	втДанныеДокумента.Требуется КАК Требуется
	               |ИЗ
	               |	втДанныеДокумента КАК втДанныеДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки(&МоментВремени, Склад = &Склад) КАК СвободныеОстаткиОстатки
	               |		ПО втДанныеДокумента.Товар = СвободныеОстаткиОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	ВыборкаТоваров = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Пока ВыборкаТоваров.Следующий() Цикл
		
		Если ВыборкаТоваров.ПроверкаОстатков < 0 Тогда
			Сообщить("На складе не хватает товара " + ВыборкаТоваров.Товар);
			Возврат;
		Иначе
			Движение = Движения.БронированиеТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = ВыборкаТоваров.Товар;
			Движение.Склад = Склад;
			Движение.КоличествоЗабронированного = ВыборкаТоваров.Требуется;
			
			//регистр СвободныеОСтатки
			Движение = Движения.СвободныеОстатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ВыборкаТоваров.Товар;
			Движение.Склад = Склад;
			Движение.КоличествоВСвободномОстатке = ВыборкаТоваров.Требуется;
		КонецЕсли;
		
	
	
		
	КонецЦикла;
	Движения.БронированиеТоваров.Записать();
	Движения.СвободныеОстатки.Записать();
	
КонецПроцедуры
